In [94]:
import pandas as pd

# We will create a list of Python Dictonaries
dict_items = [
    {'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
    {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
    {'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}
]

print(' Python list of dictionary: \n', dict_items)

 Python list of dictionary:
 [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes': 8, 'suits': 45}, {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants': 5, 'shirts': 2, 'shoes': 5, 'suits': 7}, {'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes': 10}]

In [95]:
store_items = pd.DataFrame(dict_items, index = ['store 1', 'store 2', 'store 3'])
print(' store_items DataFrame:')
store_items

 store_items DataFrame:

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [96]:
# Get a Pandas Boolean DataFrame comprises of True Or False coreesponding to Not NaN and NaN values
store_items.isnull()

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1  False     True  False   False  False  False    False
store 2  False    False  False   False  False  False    False
store 3  False    False  False    True  False   True    False

In [97]:
# Get a Pandas Series with the sum of True values along Columns
store_items.isnull().sum()

bikes      0
glasses    1
pants      0
shirts     1
shoes      0
suits      1
watches    0
dtype: int64

In [98]:
# Now we will calculate sum of Pandas Series mentioned above
store_items.isnull().sum().sum()

3

In [99]:
# Eliminate rows from our DataFrame that contains NaN values.
# By default elimination takes <out of place>
# To happen Elimination <in place> provide <inplace = True> as argument.
store_items.dropna(axis = 0, inplace = False)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0      5    7.0       10

In [100]:
# Eliminate columns from our DataFrame that contains NaN values.
store_items.dropna(axis = 1, inplace = False)

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

In [101]:
# original store_items DataFrame
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [102]:
# Replace NaN value using previous known value along Column axis
store_items.fillna(method = 'ffill', axis = 1)
# We may use <store_items.fillna(method = 'ffill', axis = 0)>
# to replace NaN value using previous known value along Row axis

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [103]:
# Replace NaN value using next known value along Column axis
store_items.fillna(method = 'backfill', axis = 1)
# We may use <store_items.fillna(method = 'backfill', axis = 0)> to
# replace NaN value using next known value along Row axis

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     30.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    10.0   10.0   35.0     35.0

In [104]:
# Following method will use Linear Interpolation method to replace NaN
# values using the values along Column axis
store_items.interpolate(method = 'linear', axis = 1)
# Following method will use Linear Interpolation method to replace NaN
# values using the values along Row axis

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0